from string import Template
#### Rag PROMPTS ####

#### النظام ####

system_prompt = Template("\n".join([
    "أنت مساعد لتوليد رد على استفسار المستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
    "يجب عليك توليد رد بناءً على المستندات المقدمة.",
    "تجاهل المستندات التي لا ترتبط باستفسار المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد رد.",
    "يجب عليك توليد الرد بنفس لغة استفسار المستخدم.",
    "كن مهذباً ومحترماً في تعاملك مع المستخدم.",
    "كن دقيقاً ومختصراً في ردك. تجنب التفاصيل غير الضرورية والمعلومات الزائدة.",
]))

#### المستندات ####

document_prompt = Template("\n".join([
    "## المستند رقم: $doc_num",
    "### المحتوى: $chunk_text",
]))

#### الخاتمة ####

footer_prompt = Template("\n".join([
    "اعتماداً فقط على المستندات أعلاه، يرجى توليد إجابة للمستخدم.",
    "## الإجابة:",
]))
